{
	"meta": {
		"theme": "elegant"
	},
	"basics": {
		"name": "Charles DZADU",
		"label": "Développeur Web et Mobile",
		"picture": "https://avatars.githubusercontent.com/u/63238348?v=4",
		"summary": "Esprit passionné du code et créatif dévoué, je fusionne le développement précis d'applications web et mobiles avec une maîtrise fluide de l'expérience utilisateur UX/UI. Créateur de plus de 40 sites No-Code, et architecte de 12 applications web et 7 applications mobiles. Déterminé à stimuler votre entreprise, j'insuffle des solutions innovantes avec une confiance intellectuelle, en vue d'engendrer un impact positif pérenne.",
		"website": "https://dzadu.dev",
		"email": "charles@dzadu.dev",
		"phone": "+228 92569918",
		"location": {
			"address": "Lomé, Togo",
			"postalCode": "BP 801",
			"city": "Lomé",
			"countryCode": "TG",
			"region": "Région Maritime"
		},
		"profiles": [
			{
				"network": "LinkedIn",
				"username": "charlesdzadu",
				"url": "https://www.linkedin.com/in/charlesdzadu/"
			},
			{
				"network": "GitHub",
				"username": "charlesdzadu",
				"url": "https://github.com/charlesdzadu"
			},
			{
				"network": "Twitter",
				"username": "charlesdzadu",
				"url": "https://twitter.com/charlesdzadu"
			}
		]
	},
	"education": [
		{
			"institution": "Université de Lomé",
			"area": "Mathématiques et Informatique",
			"studyType": "Licence",
			"startDate": "2016-10-01",
			"endDate": "2020-07-01",
			"score": "Mention Bien"
		}
	],
	"references": [
		{
			"name": "Cyrille Ahlonko",
			"reference": "Charles a été recruté en tant que développeur web et mobile dans notre startup. Il s'est montré très efficace et a su s'adapter à notre environnement de travail. Sa productivité et sa capacité à apporter des solutions à nos problèmes ont été grandement appréciées par toute l'équipe."
		}
	],
	"skills": [
		{
			"name": "Développeur Frontend",
			"level": "Moyen",
			"keywords": [
				"HTML / JSX",
				"CSS / SCSS, TailwindCSS",
				"JavaScript / TypeScript",
				"VueJS / NuxtJS",
				"Pinia / Vuex"
			]
		},
		{
			"name": "Développeur Backend",
			"level": "Moyen",
			"keywords": [
				"NodeJS",
				"ExpressJS",
				"PHP / Laravel",
				"Python / FastAPI",
				"MySQL / PostgreSQL",
				"NoSQL / MongoDB"
			]
		},
		{
			"name": "Développeur Mobile",
			"level": "Moyen",
			"keywords": [
				"Flutter",
				"Firebase",
				"Android",
				"iOS"
			]
		},
		{
			"name": "DevOps",
			"level": "Avancé",
			"keywords": [
				"Git / GitHub",
				"Linux",
				"Docker"
			]
		}
	],
	"awards": [
		{
			"title": "Prix de la Meilleure Solution Innovante",
			"date": "2023-01-30",
			"awarder": "PNUD - Ministère de la Jeunesse et de l'Emploi",
			"summary": "J'ai remporté le prix de la meilleure solution innovante dans le domaine du numérique avec Makifaa, une banque d'images typiquement africaine."
		}
	],
	"work": [
		{
			"summary": "L'identité de l'Afrique est trop souvent absente de la communication digitale. J'ai créé une banque d'images typiquement africaine pour connecter les professionnels de la photographie aux entreprises de communication, dans le but de promouvoir l'image de l'Afrique.",
			"website": "https://makifaa.com",
			"name": "Makifaa",
			"position": "Développeur Fullstack",
			"location": "Lomé - Togo",
			"startDate": "2023-03-05",
			"endDate": "2023-07-05",
			"highlights": [
				"VueJS / NuxtJS",
				"TailwindCSS",
				"Docker / Docker Compose",
				"Design de l'application web avec Figma",
				"Réduction du temps de chargement des images de 3 minutes à seulement 9 secondes par image grâce à l'intégration d'une IA de reconnaissance d'images, améliorant ainsi l'efficacité du téléchargement pour les utilisateurs",
				"Configuration complète d'un serveur Linux avec NGINX pour le déploiement du projet via Docker, aboutissant à un site extrêmement rapide et augmentant le taux de visite.",
				"Mise en place de MeiliSearch pour optimiser les recherches d'images, offrant des résultats pertinents et rapides et améliorant l'expérience utilisateur.",
				"Mise en œuvre de stratégies SEO efficaces, entraînant une augmentation de 60 % du trafic organique mensuel et un positionnement dans le top 3 des moteurs de recherche pour des mots-clés clés."
			]
		},
		{
			"name": "Ufami Group",
			"position": "Développeur Mobile",
			"summary": "Ufami est une application mobile d'e-commerce avec une particularité : elle propose des paiements échelonnés. J'ai développé plusieurs applications mobiles, dont l'application mobile Ufami pour les utilisateurs et UfEnergy pour les commerciaux.",
			"website": "https://play.google.com/store/apps/details?id=com.ufami.general&pli=1",
			"startDate": "2022-03-05",
			"endDate": "2023-05-23",
			"highlights": [
				"Flutter",
				"Firebase",
				"Android",
				"iOS",
				"Création d'une série d'applications mobiles e-commerce avec une fonctionnalité unique de paiements échelonnés, implémentant des solutions techniques pour gérer des transactions complexes.",
				"Développement de modules personnalisés pour stimuler les ventes, améliorant les taux de conversion de 30 % et optimisant l'expérience d'achat des utilisateurs.",
				"Création d'un système de rappels automatisés, augmentant les paiements ponctuels de 25 % en notifiant les utilisateurs, renforçant ainsi la rentabilité de la plateforme."
			]
		}
	],
	"interests": [
		{
			"name": "Open Source"
		},
		{
			"name": "Réalité Virtuelle / Augmentée"
		},
		{
			"name": "Lecture"
		}
	]
}
